app/Models/BarangModel.php

    public function getBarang()
    {
        return $this->findAll();
---
SELECT *
FROM `Barang`