app/Models/PelangganModel.php

    public function getPelanggan()
    {
        return $this->findAll();
---
SELECT *
FROM `pelanggan`