app/Models/TransaksiModel.php

    public function getTransaksi()
    {
        try {
            return $this->findAll(); // Mengambil semua data transaksi
---
SELECT *
FROM `transaksi`