app/Models/UserModel.php

SELECT *
FROM `users`
---
    public function getusers()
    {
        // Mengambil semua data dari tabel
        return $this->findAll();